import org.springframework.stereotype.Component;
import userInterface.UserInterface;

@Component
public class LogAnalyzer {
    UserInterface UI;





    //общий цикл
    /*
    - привествие
    () инструкция
    () основной цикл
    () изКонтинью?
     */


    // основной цикл - логаналайзер
/*
() запрос параметров
//пользовательские параметры
- получение путей (ссылка или файловый путь)
- получение дат сортировки
- получение выбранного формата
//системные параметры
- размер перцентиля

() анализ
- создание и объединение единого потока данных по путям или ссылкам
- применение параметров отсева
- прохождение каждой логсущности через коллекторы
-

() отчет
- собрать данные со всех коллекторов в отчет
- создать отчет по формату
- выдать его пользователю
 */
}
